In [1]:
import pandas as pd

In [113]:
mydf = pd.read_csv('C:\\Users\\ajaym\\Desktop\\Titanic\\artifacts\\data_ingestion\\Titanic-Dataset.csv')

In [114]:
mydf.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [115]:
mydf.drop(columns= ['PassengerId', 'Name', 'Ticket', 'Cabin'], axis = 1, inplace = True)

In [116]:
mydf.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [117]:
train_X = mydf.drop(columns = 'Survived', axis = 1)

In [121]:
train_Y = mydf[['Survived']]

In [123]:
train_X

     Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         3    male  22.0      1      0   7.2500        S
1         1  female  38.0      1      0  71.2833        C
2         3  female  26.0      0      0   7.9250        S
3         1  female  35.0      1      0  53.1000        S
4         3    male  35.0      0      0   8.0500        S
..      ...     ...   ...    ...    ...      ...      ...
886       2    male  27.0      0      0  13.0000        S
887       1  female  19.0      0      0  30.0000        S
888       3  female   NaN      1      2  23.4500        S
889       1    male  26.0      0      0  30.0000        C
890       3    male  32.0      0      0   7.7500        Q

[891 rows x 7 columns]

In [124]:
train_Y

     Survived
0           0
1           1
2           1
3           1
4           0
..        ...
886         0
887         1
888         0
889         1
890         0

[891 rows x 1 columns]

In [128]:
import numpy as np
import pandas as pd
xx =  pd.DataFrame(np.c_[train_X, train_Y])

In [129]:
xx.head()

   0       1     2  3  4        5  6  7
0  3    male  22.0  1  0     7.25  S  0
1  1  female  38.0  1  0  71.2833  C  1
2  3  female  26.0  0  0    7.925  S  1
3  1  female  35.0  1  0     53.1  S  1
4  3    male  35.0  0  0     8.05  S  0

In [107]:
preprocessor = ColumnTransformer(
                [
                    
                    ('categoricPipeline', categoric_pipeline, ['Embarked'])
                ]
            )

In [108]:
trainy = preprocessor.fit_transform(train_Y)

In [109]:
trainy = pd.DataFrame(trainy)

In [112]:
trainy

            0         1
0    0.000000  2.239641
1    0.000000  0.000000
2    0.000000  2.239641
3    0.000000  2.239641
4    0.000000  2.239641
..        ...       ...
886  0.000000  2.239641
887  0.000000  2.239641
888  0.000000  2.239641
889  0.000000  0.000000
890  3.558936  0.000000

[891 rows x 2 columns]